MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512h.h
extern volatile __EMAC1MWTDbits_t EMAC1MWTDbits __asm__ ("EMAC1MWTD") __attribute__((section("sfrs"), address(0xBF8892B0)));
#define EMACxMWTD EMACxMWTD
extern volatile uint32_t   EMACxMWTD __attribute__((section("sfrs"), address(0xBF8892B0)));
typedef union {
  struct {
    uint32_t MWTD:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMWTDbits_t;
extern volatile __EMACxMWTDbits_t EMACxMWTDbits __asm__ ("EMACxMWTD") __attribute__((section("sfrs"), address(0xBF8892B0)));
extern volatile uint32_t        EMAC1MWTDCLR __attribute__((section("sfrs"),address(0xBF8892B4)));
extern volatile uint32_t        EMACxMWTDCLR __attribute__((section("sfrs"),address(0xBF8892B4)));
extern volatile uint32_t        EMAC1MWTDSET __attribute__((section("sfrs"),address(0xBF8892B8)));
extern volatile uint32_t        EMACxMWTDSET __attribute__((section("sfrs"),address(0xBF8892B8)));
extern volatile uint32_t        EMAC1MWTDINV __attribute__((section("sfrs"),address(0xBF8892BC)));
extern volatile uint32_t        EMACxMWTDINV __attribute__((section("sfrs"),address(0xBF8892BC)));
#define EMAC1MRDD EMAC1MRDD
extern volatile uint32_t   EMAC1MRDD __attribute__((section("sfrs"), address(0xBF8892C0)));
typedef union {
  struct {
    uint32_t MRDD:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MRDDbits_t;
extern volatile __EMAC1MRDDbits_t EMAC1MRDDbits __asm__ ("EMAC1MRDD") __attribute__((section("sfrs"), address(0xBF8892C0)));
#define EMACxMRDD EMACxMRDD
extern volatile uint32_t   EMACxMRDD __attribute__((section("sfrs"), address(0xBF8892C0)));
typedef union {
  struct {
    uint32_t MRDD:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMRDDbits_t;
extern volatile __EMACxMRDDbits_t EMACxMRDDbits __asm__ ("EMACxMRDD") __attribute__((section("sfrs"), address(0xBF8892C0)));
extern volatile uint32_t        EMAC1MRDDCLR __attribute__((section("sfrs"),address(0xBF8892C4)));
extern volatile uint32_t        EMACxMRDDCLR __attribute__((section("sfrs"),address(0xBF8892C4)));
extern volatile uint32_t        EMAC1MRDDSET __attribute__((section("sfrs"),address(0xBF8892C8)));
extern volatile uint32_t        EMACxMRDDSET __attribute__((section("sfrs"),address(0xBF8892C8)));
extern volatile uint32_t        EMAC1MRDDINV __attribute__((section("sfrs"),address(0xBF8892CC)));
extern volatile uint32_t        EMACxMRDDINV __attribute__((section("sfrs"),address(0xBF8892CC)));
#define EMAC1MIND EMAC1MIND
extern volatile uint32_t   EMAC1MIND __attribute__((section("sfrs"), address(0xBF8892D0)));
typedef union {
  struct {
    uint32_t MIIMBUSY:1;
    uint32_t SCAN:1;
    uint32_t NOTVALID:1;
    uint32_t LINKFAIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MINDbits_t;
extern volatile __EMAC1MINDbits_t EMAC1MINDbits __asm__ ("EMAC1MIND") __attribute__((section("sfrs"), address(0xBF8892D0)));
#define EMACxMIND EMACxMIND
extern volatile uint32_t   EMACxMIND __attribute__((section("sfrs"), address(0xBF8892D0)));
typedef union {
  struct {
    uint32_t MIIMBUSY:1;
    uint32_t SCAN:1;
    uint32_t NOTVALID:1;
    uint32_t LINKFAIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMINDbits_t;
extern volatile __EMACxMINDbits_t EMACxMINDbits __asm__ ("EMACxMIND") __attribute__((section("sfrs"), address(0xBF8892D0)));
extern volatile uint32_t        EMAC1MINDCLR __attribute__((section("sfrs"),address(0xBF8892D4)));
extern volatile uint32_t        EMACxMINDCLR __attribute__((section("sfrs"),address(0xBF8892D4)));
extern volatile uint32_t        EMAC1MINDSET __attribute__((section("sfrs"),address(0xBF8892D8)));
extern volatile uint32_t        EMACxMINDSET __attribute__((section("sfrs"),address(0xBF8892D8)));
extern volatile uint32_t        EMAC1MINDINV __attribute__((section("sfrs"),address(0xBF8892DC)));
extern volatile uint32_t        EMACxMINDINV __attribute__((section("sfrs"),address(0xBF8892DC)));
#define EMAC1SA0 EMAC1SA0
extern volatile uint32_t   EMAC1SA0 __attribute__((section("sfrs"), address(0xBF889300)));
typedef union {
  struct {
    uint32_t STNADDR5:8;
    uint32_t STNADDR6:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1SA0bits_t;
extern volatile __EMAC1SA0bits_t EMAC1SA0bits __asm__ ("EMAC1SA0") __attribute__((section("sfrs"), address(0xBF889300)));
#define EMACxSA0 EMACxSA0
extern volatile uint32_t   EMACxSA0 __attribute__((section("sfrs"), address(0xBF889300)));
typedef union {
  struct {
    uint32_t STNADDR5:8;
    uint32_t STNADDR6:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxSA0bits_t;
extern volatile __EMACxSA0bits_t EMACxSA0bits __asm__ ("EMACxSA0") __attribute__((section("sfrs"), address(0xBF889300)));
extern volatile uint32_t        EMAC1SA0CLR __attribute__((section("sfrs"),address(0xBF889304)));
extern volatile uint32_t        EMACxSA0CLR __attribute__((section("sfrs"),address(0xBF889304)));
extern volatile uint32_t        EMAC1SA0SET __attribute__((section("sfrs"),address(0xBF889308)));
extern volatile uint32_t        EMACxSA0SET __attribute__((section("sfrs"),address(0xBF889308)));
extern volatile uint32_t        EMAC1SA0INV __attribute__((section("sfrs"),address(0xBF88930C)));
extern volatile uint32_t        EMACxSA0INV __attribute__((section("sfrs"),address(0xBF88930C)));
#define EMAC1SA1 EMAC1SA1
extern volatile uint32_t   EMAC1SA1 __attribute__((section("sfrs"), address(0xBF889310)));
typedef union {
  struct {
    uint32_t STNADDR3:8;
    uint32_t STNADDR4:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1SA1bits_t;
extern volatile __EMAC1SA1bits_t EMAC1SA1bits __asm__ ("EMAC1SA1") __attribute__((section("sfrs"), address(0xBF889310)));
#define EMACxSA1 EMACxSA1
extern volatile uint32_t   EMACxSA1 __attribute__((section("sfrs"), address(0xBF889310)));
typedef union {
  struct {
    uint32_t STNADDR3:8;
    uint32_t STNADDR4:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxSA1bits_t;
extern volatile __EMACxSA1bits_t EMACxSA1bits __asm__ ("EMACxSA1") __attribute__((section("sfrs"), address(0xBF889310)));
extern volatile uint32_t        EMAC1SA1CLR __attribute__((section("sfrs"),address(0xBF889314)));
extern volatile uint32_t        EMACxSA1CLR __attribute__((section("sfrs"),address(0xBF889314)));
extern volatile uint32_t        EMAC1SA1SET __attribute__((section("sfrs"),address(0xBF889318)));
extern volatile uint32_t        EMACxSA1SET __attribute__((section("sfrs"),address(0xBF889318)));
extern volatile uint32_t        EMAC1SA1INV __attribute__((section("sfrs"),address(0xBF88931C)));
extern volatile uint32_t        EMACxSA1INV __attribute__((section("sfrs"),address(0xBF88931C)));
#define EMAC1SA2 EMAC1SA2
extern volatile uint32_t   EMAC1SA2 __attribute__((section("sfrs"), address(0xBF889320)));
typedef union {
  struct {
    uint32_t STNADDR1:8;
    uint32_t STNADDR2:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1SA2bits_t;
extern volatile __EMAC1SA2bits_t EMAC1SA2bits __asm__ ("EMAC1SA2") __attribute__((section("sfrs"), address(0xBF889320)));
#define EMACxSA2 EMACxSA2
extern volatile uint32_t   EMACxSA2 __attribute__((section("sfrs"), address(0xBF889320)));
typedef union {
  struct {
    uint32_t STNADDR1:8;
    uint32_t STNADDR2:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxSA2bits_t;
