MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512h.h
extern volatile __C2FIFOCI8bits_t C2FIFOCI8bits __asm__ ("C2FIFOCI8") __attribute__((section("sfrs"), address(0xBF88C580)));
extern volatile uint32_t        C2FIFOCI8CLR __attribute__((section("sfrs"),address(0xBF88C584)));
extern volatile uint32_t        C2FIFOCI8SET __attribute__((section("sfrs"),address(0xBF88C588)));
extern volatile uint32_t        C2FIFOCI8INV __attribute__((section("sfrs"),address(0xBF88C58C)));
#define C2FIFOCON9 C2FIFOCON9
extern volatile uint32_t   C2FIFOCON9 __attribute__((section("sfrs"), address(0xBF88C590)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON9bits_t;
extern volatile __C2FIFOCON9bits_t C2FIFOCON9bits __asm__ ("C2FIFOCON9") __attribute__((section("sfrs"), address(0xBF88C590)));
extern volatile uint32_t        C2FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF88C594)));
extern volatile uint32_t        C2FIFOCON9SET __attribute__((section("sfrs"),address(0xBF88C598)));
extern volatile uint32_t        C2FIFOCON9INV __attribute__((section("sfrs"),address(0xBF88C59C)));
#define C2FIFOINT9 C2FIFOINT9
extern volatile uint32_t   C2FIFOINT9 __attribute__((section("sfrs"), address(0xBF88C5A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT9bits_t;
extern volatile __C2FIFOINT9bits_t C2FIFOINT9bits __asm__ ("C2FIFOINT9") __attribute__((section("sfrs"), address(0xBF88C5A0)));
extern volatile uint32_t        C2FIFOINT9CLR __attribute__((section("sfrs"),address(0xBF88C5A4)));
extern volatile uint32_t        C2FIFOINT9SET __attribute__((section("sfrs"),address(0xBF88C5A8)));
extern volatile uint32_t        C2FIFOINT9INV __attribute__((section("sfrs"),address(0xBF88C5AC)));
#define C2FIFOUA9 C2FIFOUA9
extern volatile uint32_t   C2FIFOUA9 __attribute__((section("sfrs"), address(0xBF88C5B0)));
extern volatile uint32_t        C2FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF88C5B4)));
extern volatile uint32_t        C2FIFOUA9SET __attribute__((section("sfrs"),address(0xBF88C5B8)));
extern volatile uint32_t        C2FIFOUA9INV __attribute__((section("sfrs"),address(0xBF88C5BC)));
#define C2FIFOCI9 C2FIFOCI9
extern volatile uint32_t   C2FIFOCI9 __attribute__((section("sfrs"), address(0xBF88C5C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI9bits_t;
extern volatile __C2FIFOCI9bits_t C2FIFOCI9bits __asm__ ("C2FIFOCI9") __attribute__((section("sfrs"), address(0xBF88C5C0)));
extern volatile uint32_t        C2FIFOCI9CLR __attribute__((section("sfrs"),address(0xBF88C5C4)));
extern volatile uint32_t        C2FIFOCI9SET __attribute__((section("sfrs"),address(0xBF88C5C8)));
extern volatile uint32_t        C2FIFOCI9INV __attribute__((section("sfrs"),address(0xBF88C5CC)));
#define C2FIFOCON10 C2FIFOCON10
extern volatile uint32_t   C2FIFOCON10 __attribute__((section("sfrs"), address(0xBF88C5D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON10bits_t;
extern volatile __C2FIFOCON10bits_t C2FIFOCON10bits __asm__ ("C2FIFOCON10") __attribute__((section("sfrs"), address(0xBF88C5D0)));
extern volatile uint32_t        C2FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF88C5D4)));
extern volatile uint32_t        C2FIFOCON10SET __attribute__((section("sfrs"),address(0xBF88C5D8)));
extern volatile uint32_t        C2FIFOCON10INV __attribute__((section("sfrs"),address(0xBF88C5DC)));
#define C2FIFOINT10 C2FIFOINT10
extern volatile uint32_t   C2FIFOINT10 __attribute__((section("sfrs"), address(0xBF88C5E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT10bits_t;
extern volatile __C2FIFOINT10bits_t C2FIFOINT10bits __asm__ ("C2FIFOINT10") __attribute__((section("sfrs"), address(0xBF88C5E0)));
extern volatile uint32_t        C2FIFOINT10CLR __attribute__((section("sfrs"),address(0xBF88C5E4)));
extern volatile uint32_t        C2FIFOINT10SET __attribute__((section("sfrs"),address(0xBF88C5E8)));
extern volatile uint32_t        C2FIFOINT10INV __attribute__((section("sfrs"),address(0xBF88C5EC)));
#define C2FIFOUA10 C2FIFOUA10
extern volatile uint32_t   C2FIFOUA10 __attribute__((section("sfrs"), address(0xBF88C5F0)));
extern volatile uint32_t        C2FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF88C5F4)));
extern volatile uint32_t        C2FIFOUA10SET __attribute__((section("sfrs"),address(0xBF88C5F8)));
extern volatile uint32_t        C2FIFOUA10INV __attribute__((section("sfrs"),address(0xBF88C5FC)));
#define C2FIFOCI10 C2FIFOCI10
extern volatile uint32_t   C2FIFOCI10 __attribute__((section("sfrs"), address(0xBF88C600)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI10bits_t;
extern volatile __C2FIFOCI10bits_t C2FIFOCI10bits __asm__ ("C2FIFOCI10") __attribute__((section("sfrs"), address(0xBF88C600)));
extern volatile uint32_t        C2FIFOCI10CLR __attribute__((section("sfrs"),address(0xBF88C604)));
extern volatile uint32_t        C2FIFOCI10SET __attribute__((section("sfrs"),address(0xBF88C608)));
extern volatile uint32_t        C2FIFOCI10INV __attribute__((section("sfrs"),address(0xBF88C60C)));
#define C2FIFOCON11 C2FIFOCON11
extern volatile uint32_t   C2FIFOCON11 __attribute__((section("sfrs"), address(0xBF88C610)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON11bits_t;
extern volatile __C2FIFOCON11bits_t C2FIFOCON11bits __asm__ ("C2FIFOCON11") __attribute__((section("sfrs"), address(0xBF88C610)));
extern volatile uint32_t        C2FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF88C614)));
extern volatile uint32_t        C2FIFOCON11SET __attribute__((section("sfrs"),address(0xBF88C618)));
extern volatile uint32_t        C2FIFOCON11INV __attribute__((section("sfrs"),address(0xBF88C61C)));
#define C2FIFOINT11 C2FIFOINT11
extern volatile uint32_t   C2FIFOINT11 __attribute__((section("sfrs"), address(0xBF88C620)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT11bits_t;
extern volatile __C2FIFOINT11bits_t C2FIFOINT11bits __asm__ ("C2FIFOINT11") __attribute__((section("sfrs"), address(0xBF88C620)));
extern volatile uint32_t        C2FIFOINT11CLR __attribute__((section("sfrs"),address(0xBF88C624)));
extern volatile uint32_t        C2FIFOINT11SET __attribute__((section("sfrs"),address(0xBF88C628)));
extern volatile uint32_t        C2FIFOINT11INV __attribute__((section("sfrs"),address(0xBF88C62C)));
#define C2FIFOUA11 C2FIFOUA11
extern volatile uint32_t   C2FIFOUA11 __attribute__((section("sfrs"), address(0xBF88C630)));
extern volatile uint32_t        C2FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF88C634)));
extern volatile uint32_t        C2FIFOUA11SET __attribute__((section("sfrs"),address(0xBF88C638)));
extern volatile uint32_t        C2FIFOUA11INV __attribute__((section("sfrs"),address(0xBF88C63C)));
#define C2FIFOCI11 C2FIFOCI11
extern volatile uint32_t   C2FIFOCI11 __attribute__((section("sfrs"), address(0xBF88C640)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI11bits_t;
extern volatile __C2FIFOCI11bits_t C2FIFOCI11bits __asm__ ("C2FIFOCI11") __attribute__((section("sfrs"), address(0xBF88C640)));
extern volatile uint32_t        C2FIFOCI11CLR __attribute__((section("sfrs"),address(0xBF88C644)));
extern volatile uint32_t        C2FIFOCI11SET __attribute__((section("sfrs"),address(0xBF88C648)));
extern volatile uint32_t        C2FIFOCI11INV __attribute__((section("sfrs"),address(0xBF88C64C)));
#define C2FIFOCON12 C2FIFOCON12
extern volatile uint32_t   C2FIFOCON12 __attribute__((section("sfrs"), address(0xBF88C650)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON12bits_t;
extern volatile __C2FIFOCON12bits_t C2FIFOCON12bits __asm__ ("C2FIFOCON12") __attribute__((section("sfrs"), address(0xBF88C650)));
extern volatile uint32_t        C2FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF88C654)));
extern volatile uint32_t        C2FIFOCON12SET __attribute__((section("sfrs"),address(0xBF88C658)));
extern volatile uint32_t        C2FIFOCON12INV __attribute__((section("sfrs"),address(0xBF88C65C)));
#define C2FIFOINT12 C2FIFOINT12
extern volatile uint32_t   C2FIFOINT12 __attribute__((section("sfrs"), address(0xBF88C660)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT12bits_t;
extern volatile __C2FIFOINT12bits_t C2FIFOINT12bits __asm__ ("C2FIFOINT12") __attribute__((section("sfrs"), address(0xBF88C660)));
extern volatile uint32_t        C2FIFOINT12CLR __attribute__((section("sfrs"),address(0xBF88C664)));
extern volatile uint32_t        C2FIFOINT12SET __attribute__((section("sfrs"),address(0xBF88C668)));
extern volatile uint32_t        C2FIFOINT12INV __attribute__((section("sfrs"),address(0xBF88C66C)));
#define C2FIFOUA12 C2FIFOUA12
extern volatile uint32_t   C2FIFOUA12 __attribute__((section("sfrs"), address(0xBF88C670)));
extern volatile uint32_t        C2FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF88C674)));
extern volatile uint32_t        C2FIFOUA12SET __attribute__((section("sfrs"),address(0xBF88C678)));
extern volatile uint32_t        C2FIFOUA12INV __attribute__((section("sfrs"),address(0xBF88C67C)));
#define C2FIFOCI12 C2FIFOCI12
extern volatile uint32_t   C2FIFOCI12 __attribute__((section("sfrs"), address(0xBF88C680)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI12bits_t;
extern volatile __C2FIFOCI12bits_t C2FIFOCI12bits __asm__ ("C2FIFOCI12") __attribute__((section("sfrs"), address(0xBF88C680)));
extern volatile uint32_t        C2FIFOCI12CLR __attribute__((section("sfrs"),address(0xBF88C684)));
extern volatile uint32_t        C2FIFOCI12SET __attribute__((section("sfrs"),address(0xBF88C688)));
extern volatile uint32_t        C2FIFOCI12INV __attribute__((section("sfrs"),address(0xBF88C68C)));
#define C2FIFOCON13 C2FIFOCON13
extern volatile uint32_t   C2FIFOCON13 __attribute__((section("sfrs"), address(0xBF88C690)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON13bits_t;
extern volatile __C2FIFOCON13bits_t C2FIFOCON13bits __asm__ ("C2FIFOCON13") __attribute__((section("sfrs"), address(0xBF88C690)));
extern volatile uint32_t        C2FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF88C694)));
extern volatile uint32_t        C2FIFOCON13SET __attribute__((section("sfrs"),address(0xBF88C698)));
extern volatile uint32_t        C2FIFOCON13INV __attribute__((section("sfrs"),address(0xBF88C69C)));
#define C2FIFOINT13 C2FIFOINT13
extern volatile uint32_t   C2FIFOINT13 __attribute__((section("sfrs"), address(0xBF88C6A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT13bits_t;
extern volatile __C2FIFOINT13bits_t C2FIFOINT13bits __asm__ ("C2FIFOINT13") __attribute__((section("sfrs"), address(0xBF88C6A0)));
extern volatile uint32_t        C2FIFOINT13CLR __attribute__((section("sfrs"),address(0xBF88C6A4)));
extern volatile uint32_t        C2FIFOINT13SET __attribute__((section("sfrs"),address(0xBF88C6A8)));
extern volatile uint32_t        C2FIFOINT13INV __attribute__((section("sfrs"),address(0xBF88C6AC)));
#define C2FIFOUA13 C2FIFOUA13
extern volatile uint32_t   C2FIFOUA13 __attribute__((section("sfrs"), address(0xBF88C6B0)));
extern volatile uint32_t        C2FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF88C6B4)));
extern volatile uint32_t        C2FIFOUA13SET __attribute__((section("sfrs"),address(0xBF88C6B8)));
extern volatile uint32_t        C2FIFOUA13INV __attribute__((section("sfrs"),address(0xBF88C6BC)));
#define C2FIFOCI13 C2FIFOCI13
extern volatile uint32_t   C2FIFOCI13 __attribute__((section("sfrs"), address(0xBF88C6C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI13bits_t;
