MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512h.h
extern volatile __C2FIFOCON17bits_t C2FIFOCON17bits __asm__ ("C2FIFOCON17") __attribute__((section("sfrs"), address(0xBF88C790)));
extern volatile uint32_t        C2FIFOCON17CLR __attribute__((section("sfrs"),address(0xBF88C794)));
extern volatile uint32_t        C2FIFOCON17SET __attribute__((section("sfrs"),address(0xBF88C798)));
extern volatile uint32_t        C2FIFOCON17INV __attribute__((section("sfrs"),address(0xBF88C79C)));
#define C2FIFOINT17 C2FIFOINT17
extern volatile uint32_t   C2FIFOINT17 __attribute__((section("sfrs"), address(0xBF88C7A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT17bits_t;
extern volatile __C2FIFOINT17bits_t C2FIFOINT17bits __asm__ ("C2FIFOINT17") __attribute__((section("sfrs"), address(0xBF88C7A0)));
extern volatile uint32_t        C2FIFOINT17CLR __attribute__((section("sfrs"),address(0xBF88C7A4)));
extern volatile uint32_t        C2FIFOINT17SET __attribute__((section("sfrs"),address(0xBF88C7A8)));
extern volatile uint32_t        C2FIFOINT17INV __attribute__((section("sfrs"),address(0xBF88C7AC)));
#define C2FIFOUA17 C2FIFOUA17
extern volatile uint32_t   C2FIFOUA17 __attribute__((section("sfrs"), address(0xBF88C7B0)));
extern volatile uint32_t        C2FIFOUA17CLR __attribute__((section("sfrs"),address(0xBF88C7B4)));
extern volatile uint32_t        C2FIFOUA17SET __attribute__((section("sfrs"),address(0xBF88C7B8)));
extern volatile uint32_t        C2FIFOUA17INV __attribute__((section("sfrs"),address(0xBF88C7BC)));
#define C2FIFOCI17 C2FIFOCI17
extern volatile uint32_t   C2FIFOCI17 __attribute__((section("sfrs"), address(0xBF88C7C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI17bits_t;
extern volatile __C2FIFOCI17bits_t C2FIFOCI17bits __asm__ ("C2FIFOCI17") __attribute__((section("sfrs"), address(0xBF88C7C0)));
extern volatile uint32_t        C2FIFOCI17CLR __attribute__((section("sfrs"),address(0xBF88C7C4)));
extern volatile uint32_t        C2FIFOCI17SET __attribute__((section("sfrs"),address(0xBF88C7C8)));
extern volatile uint32_t        C2FIFOCI17INV __attribute__((section("sfrs"),address(0xBF88C7CC)));
#define C2FIFOCON18 C2FIFOCON18
extern volatile uint32_t   C2FIFOCON18 __attribute__((section("sfrs"), address(0xBF88C7D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON18bits_t;
extern volatile __C2FIFOCON18bits_t C2FIFOCON18bits __asm__ ("C2FIFOCON18") __attribute__((section("sfrs"), address(0xBF88C7D0)));
extern volatile uint32_t        C2FIFOCON18CLR __attribute__((section("sfrs"),address(0xBF88C7D4)));
extern volatile uint32_t        C2FIFOCON18SET __attribute__((section("sfrs"),address(0xBF88C7D8)));
extern volatile uint32_t        C2FIFOCON18INV __attribute__((section("sfrs"),address(0xBF88C7DC)));
#define C2FIFOINT18 C2FIFOINT18
extern volatile uint32_t   C2FIFOINT18 __attribute__((section("sfrs"), address(0xBF88C7E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT18bits_t;
extern volatile __C2FIFOINT18bits_t C2FIFOINT18bits __asm__ ("C2FIFOINT18") __attribute__((section("sfrs"), address(0xBF88C7E0)));
extern volatile uint32_t        C2FIFOINT18CLR __attribute__((section("sfrs"),address(0xBF88C7E4)));
extern volatile uint32_t        C2FIFOINT18SET __attribute__((section("sfrs"),address(0xBF88C7E8)));
extern volatile uint32_t        C2FIFOINT18INV __attribute__((section("sfrs"),address(0xBF88C7EC)));
#define C2FIFOUA18 C2FIFOUA18
extern volatile uint32_t   C2FIFOUA18 __attribute__((section("sfrs"), address(0xBF88C7F0)));
extern volatile uint32_t        C2FIFOUA18CLR __attribute__((section("sfrs"),address(0xBF88C7F4)));
extern volatile uint32_t        C2FIFOUA18SET __attribute__((section("sfrs"),address(0xBF88C7F8)));
extern volatile uint32_t        C2FIFOUA18INV __attribute__((section("sfrs"),address(0xBF88C7FC)));
#define C2FIFOCI18 C2FIFOCI18
extern volatile uint32_t   C2FIFOCI18 __attribute__((section("sfrs"), address(0xBF88C800)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI18bits_t;
extern volatile __C2FIFOCI18bits_t C2FIFOCI18bits __asm__ ("C2FIFOCI18") __attribute__((section("sfrs"), address(0xBF88C800)));
extern volatile uint32_t        C2FIFOCI18CLR __attribute__((section("sfrs"),address(0xBF88C804)));
extern volatile uint32_t        C2FIFOCI18SET __attribute__((section("sfrs"),address(0xBF88C808)));
extern volatile uint32_t        C2FIFOCI18INV __attribute__((section("sfrs"),address(0xBF88C80C)));
#define C2FIFOCON19 C2FIFOCON19
extern volatile uint32_t   C2FIFOCON19 __attribute__((section("sfrs"), address(0xBF88C810)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON19bits_t;
extern volatile __C2FIFOCON19bits_t C2FIFOCON19bits __asm__ ("C2FIFOCON19") __attribute__((section("sfrs"), address(0xBF88C810)));
extern volatile uint32_t        C2FIFOCON19CLR __attribute__((section("sfrs"),address(0xBF88C814)));
extern volatile uint32_t        C2FIFOCON19SET __attribute__((section("sfrs"),address(0xBF88C818)));
extern volatile uint32_t        C2FIFOCON19INV __attribute__((section("sfrs"),address(0xBF88C81C)));
#define C2FIFOINT19 C2FIFOINT19
extern volatile uint32_t   C2FIFOINT19 __attribute__((section("sfrs"), address(0xBF88C820)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT19bits_t;
