MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f512h.h
extern volatile __C2FIFOCI26bits_t C2FIFOCI26bits __asm__ ("C2FIFOCI26") __attribute__((section("sfrs"), address(0xBF88CA00)));
extern volatile uint32_t        C2FIFOCI26CLR __attribute__((section("sfrs"),address(0xBF88CA04)));
extern volatile uint32_t        C2FIFOCI26SET __attribute__((section("sfrs"),address(0xBF88CA08)));
extern volatile uint32_t        C2FIFOCI26INV __attribute__((section("sfrs"),address(0xBF88CA0C)));
#define C2FIFOCON27 C2FIFOCON27
extern volatile uint32_t   C2FIFOCON27 __attribute__((section("sfrs"), address(0xBF88CA10)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON27bits_t;
extern volatile __C2FIFOCON27bits_t C2FIFOCON27bits __asm__ ("C2FIFOCON27") __attribute__((section("sfrs"), address(0xBF88CA10)));
extern volatile uint32_t        C2FIFOCON27CLR __attribute__((section("sfrs"),address(0xBF88CA14)));
extern volatile uint32_t        C2FIFOCON27SET __attribute__((section("sfrs"),address(0xBF88CA18)));
extern volatile uint32_t        C2FIFOCON27INV __attribute__((section("sfrs"),address(0xBF88CA1C)));
#define C2FIFOINT27 C2FIFOINT27
extern volatile uint32_t   C2FIFOINT27 __attribute__((section("sfrs"), address(0xBF88CA20)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT27bits_t;
extern volatile __C2FIFOINT27bits_t C2FIFOINT27bits __asm__ ("C2FIFOINT27") __attribute__((section("sfrs"), address(0xBF88CA20)));
extern volatile uint32_t        C2FIFOINT27CLR __attribute__((section("sfrs"),address(0xBF88CA24)));
extern volatile uint32_t        C2FIFOINT27SET __attribute__((section("sfrs"),address(0xBF88CA28)));
extern volatile uint32_t        C2FIFOINT27INV __attribute__((section("sfrs"),address(0xBF88CA2C)));
#define C2FIFOUA27 C2FIFOUA27
extern volatile uint32_t   C2FIFOUA27 __attribute__((section("sfrs"), address(0xBF88CA30)));
extern volatile uint32_t        C2FIFOUA27CLR __attribute__((section("sfrs"),address(0xBF88CA34)));
extern volatile uint32_t        C2FIFOUA27SET __attribute__((section("sfrs"),address(0xBF88CA38)));
extern volatile uint32_t        C2FIFOUA27INV __attribute__((section("sfrs"),address(0xBF88CA3C)));
#define C2FIFOCI27 C2FIFOCI27
extern volatile uint32_t   C2FIFOCI27 __attribute__((section("sfrs"), address(0xBF88CA40)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI27bits_t;
extern volatile __C2FIFOCI27bits_t C2FIFOCI27bits __asm__ ("C2FIFOCI27") __attribute__((section("sfrs"), address(0xBF88CA40)));
extern volatile uint32_t        C2FIFOCI27CLR __attribute__((section("sfrs"),address(0xBF88CA44)));
extern volatile uint32_t        C2FIFOCI27SET __attribute__((section("sfrs"),address(0xBF88CA48)));
extern volatile uint32_t        C2FIFOCI27INV __attribute__((section("sfrs"),address(0xBF88CA4C)));
#define C2FIFOCON28 C2FIFOCON28
extern volatile uint32_t   C2FIFOCON28 __attribute__((section("sfrs"), address(0xBF88CA50)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON28bits_t;
extern volatile __C2FIFOCON28bits_t C2FIFOCON28bits __asm__ ("C2FIFOCON28") __attribute__((section("sfrs"), address(0xBF88CA50)));
extern volatile uint32_t        C2FIFOCON28CLR __attribute__((section("sfrs"),address(0xBF88CA54)));
extern volatile uint32_t        C2FIFOCON28SET __attribute__((section("sfrs"),address(0xBF88CA58)));
extern volatile uint32_t        C2FIFOCON28INV __attribute__((section("sfrs"),address(0xBF88CA5C)));
#define C2FIFOINT28 C2FIFOINT28
extern volatile uint32_t   C2FIFOINT28 __attribute__((section("sfrs"), address(0xBF88CA60)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT28bits_t;
extern volatile __C2FIFOINT28bits_t C2FIFOINT28bits __asm__ ("C2FIFOINT28") __attribute__((section("sfrs"), address(0xBF88CA60)));
extern volatile uint32_t        C2FIFOINT28CLR __attribute__((section("sfrs"),address(0xBF88CA64)));
extern volatile uint32_t        C2FIFOINT28SET __attribute__((section("sfrs"),address(0xBF88CA68)));
extern volatile uint32_t        C2FIFOINT28INV __attribute__((section("sfrs"),address(0xBF88CA6C)));
#define C2FIFOUA28 C2FIFOUA28
extern volatile uint32_t   C2FIFOUA28 __attribute__((section("sfrs"), address(0xBF88CA70)));
extern volatile uint32_t        C2FIFOUA28CLR __attribute__((section("sfrs"),address(0xBF88CA74)));
extern volatile uint32_t        C2FIFOUA28SET __attribute__((section("sfrs"),address(0xBF88CA78)));
extern volatile uint32_t        C2FIFOUA28INV __attribute__((section("sfrs"),address(0xBF88CA7C)));
#define C2FIFOCI28 C2FIFOCI28
extern volatile uint32_t   C2FIFOCI28 __attribute__((section("sfrs"), address(0xBF88CA80)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI28bits_t;
